<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d013a1114ec2301ae32f2ba5b50b3699b5e99b515226e94ee30b3b425df2c888","plan_job_ref":"Job Terraform checks on pull request #43 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13517212009","plan_out_hash":"8725691e7dd8d273be45f3b2dd4c430f26ba8d6306168a07125a49f0b0f22665","plan_hash":"2eeac51d19121033c7a20238403e780d15a9a9c36dc27aa4a053de85911b8c17","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __./__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.python.core"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.python.core"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.python.core"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.python.core"
        name                        = "sudoblark.python.core"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "************"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #43](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13517212009)